---	1.Örnek	 ---
/**            OSPF - Core Network - Default Route  -  Static Route - Dynamic Routing - P2P - Router ID - BDR & DR                                                                    **/

// 2 adet Branch networkumuze bağlı birden fazla router mimarisi var. Her bir router'in farklı bir işlevi olabilir. Kimisi log tutmak için v.s. Biz Sarı networkden yeşil networke giderken verilerin Router4 üzerinde toplanmasını istiyoruz. Arada bilgiyi okumak için veya bilgiyi kaydetmek için kullanıcağımız veya bir firewall networku olacak.

İlaveten bir de  Core network'un sonunda bir toplama switchi bulunacak yedekliliği artırmak için her routerin birbirine bağlı olmasını sağlamak için Multiaccess bir SW bulunacak bir networke sahipiz.

Bu switchin bütün ortamda bulunan routerlara bağlantısı var. Amacımız multiaccess ortam oluşturmak. Bu switche hiç ekstra özellik eklemeyeceğiz. İlaveten bir de ISP Router'i koyacağız bu router'i biz yönetemeyeceğiz sadece dünyaya erişim için bağlantı sağlıyoruz. Ve ISP switchinin arkasında da Google sunucusu olacak olsun.

Genel olarak;
--------------
2 Adet Branch networkumuz var bu networkler Core networkde birden fazla router'a bağlı bu routerlar yedeklilik sağlıyor. Bu mimaride static routing yapmak hiç de kolay değil bu nedenle Dinamik Routing yapacağız. Biz Dinamik routing yaparken bir Firewall router'i bulunduruyoruz eğer bu router çalışıyorsa, ayaktaysa sarı networkden yeşil networke giden hattı FW üzerinden göndermek istiyoruz.  Normalde show speed'den bakarsak en yakın ilk 3 router'i seçecektir.  Bizim bu hatları kullanmasını istemiyorsak yüksek bir cost değeri gireceğiz. 
---------------------------------------------------------

Router0(config)#int gi0/0
Router0(config-if)#ip add 192.168.10.254 255.255.255.0
Router0(config-if)#no sh
Router0(config-if)#int gi0/1
Router0(config-if)#ip add 10.1.1.1 255.255.255.0
Router0(config-if)#no sh
Router0(config-if)#int gi0/2
Router0(config-if)#ip add 10.1.0.1 255.255.255.0
Router0(config-if)#no sh

Router5(config)#int gi0/2
Router5(config-if)#ip add 10.1.1.2 255.255.255.0
Router5(config-if)#no sh
Router5(config-if)#int gi0/1
Router5(config-if)#ip add 10.1.2.2 255.255.255.0
Router5(config-if)#no sh
Router5(config-if)#int gi0/0
Router5(config-if)#ip add 10.1.3.1 255.255.255.0
Router5(config-if)#no sh

Router2(config)#int gi0/0
Router2(config-if)#ip add 10.1.2.1 255.255.255.0
Router2(config-if)#no sh
Router2(config-if)#int gi0/1
Router2(config-if)#ip add 10.1.0.2 255.255.255.0
Router2(config-if)#no sh
Router2(config)#int gi0/2
Router2(config-if)#ip add 10.1.4.1 255.255.255.0
Router2(config-if)#no sh

Router1(config)#int gi0/0
Router1(config-if)#ip add 192.168.20.254 255.255.255.0
Router1(config-if)#no sh
Router1(config-if)#int gi0/2
Router1(config-if)#ip add 10.1.7.1 255.255.255.0
Router1(config-if)#no sh
Router1(config-if)#int gi0/1
Router1(config-if)#ip add 10.1.3.2 255.255.255.0
Router1(config-if)#no sh

FW(config)#int gi0/1
FW(config-if)#ip add 10.1.4.2 255.255.255.0 
FW(config-if)#no sh
FW(config-if)#int gi0/0
FW(config-if)#ip add 10.1.6.1 255.255.255.0 
FW(config-if)#no sh
FW(config-if)#int gi0/2
FW(config-if)#ip add 10.1.5.1 255.255.255.0 
FW(config-if)#no sh

Router6(config)#int gi0/0
Router6(config-if)#ip add 10.1.5.2 255.255.255.0
Router6(config-if)#no sh
Router6(config-if)#int gi0/1
Router6(config-if)#ip add 10.100.100.1 255.255.255.0
Router6(config-if)#no sh

Router7(config)#int gi0/0
Router7(config-if)#ip add 10.1.6.2 255.255.255.0
Router7(config-if)#no sh
Router7(config-if)#int gi0/1
Router7(config-if)#ip add 10.1.7.2 255.255.255.0
Router7(config-if)#no sh
Router7(config-if)#int gi0/2
Router7(config-if)#ip add 10.100.100.2 255.255.255.0
Router7(config-if)#no sh

// Router 9 şuan kenarda durmuş bir cihaz gibi duruyor fakat 2. bir cıkısı olan bir router gibi düşünebiliriz.
Router9(config)#int gi0/0
Router9(config-if)#ip add 10.100.100.3 255.255.255.0
Router9(config-if)#no sh

Router8(config)#int gi0/0
Router8(config-if)#ip add 10.100.100.4 255.255.255.0
Router8(config-if)#no sh
Router8(config-if)#int gi0/1
Router8(config-if)#ip add 200.200.200.1 255.255.255.0
Router8(config-if)#no sh
Router8(config-if)#exit
Router8(config)#ip route 0.0.0.0 0.0.0.0 200.200.200.2

ISP(config)#int gi0/0
ISP(config-if)#ip add 200.200.200.2 255.255.255.0
ISP(config-if)#no sh
ISP(config-if)#int gi0/1
ISP(config-if)#ip add 8.8.8.1 255.255.255.0
ISP(config-if)#no sh
ISP(config-if)#exit
ISP(config)#ip route 192.168.10.0 255.255.255.0 200.200.200.1
ISP(config)#ip route 192.168.20.0 255.255.255.0 200.200.200.1
//200.200.200.1 üzerinden 192.168.10.0 ve 192.168.20.0 ile haberleşmesini bu ağ ile iletişim kurup ip yönlendirmesini istedik.

PC0> 192.168.10.1 - 255.255.255.0 192.168.10.254
PC1> 192.168.20.1 - 255.255.255.0 192.168.20.254

---------------------------------------------------------
// Şuan bütün topolojiyi ilgilendiren yapılandırmalar var;

1. Mesela biz loopback interface'i henüz yaratmadık, sadece aktif olan interface'i yapılandırdık. Eğer biz Router ID'yi yazmazsak bu cihazlar kendi kullandıkları interfacelerdeki en yüksek IP adresini alacaktır. Bunun olmasını istemiyoruz. Bu routerların hepsinin Router ID'lerini kendimiz tanımlayacağız. Bu nedenle OSPF'e hiçbir interface'i dahil etmeden yapmamız lazım. İlk yapacağımız adım Routerların Router ID'lerini tanımlamak olacaktır.
	
2. Bir router interfacelerini kullanırken Cost değerlerini değiştirmek hiç doğru bir işlem olmayacaktır. Bir interface eğer cost değeri ile hesaplandıysa varolan çalışan altyapıda bu costun anlık değişmesi probleme yol açabilir.  Otomotik olarak ayarlayacağımız bandwidth'i herhangi bir interface eklemeden yapılandırmak zorundayız. 
---------------------------------------------------------

Router0(config)#router ospf ?
<1-65535> Process ID
Router0(config)#router ospf 200
Router0(config-router)#router-id 100.100.100.100
Router0(config-router)#auto-cost reference-bandwidth ?
	<1-4294967> The reference bandwidth in terms of Mbits per second
Router0(config-router)#auto-cost reference-bandwidth 10000
	% OSPF: Reference bandwidth is changed.
	Please ensure reference bandwidth is consistent across all routers.
	// Bizden diğer tüm routerlarda da referans bandwidth'in aynı oldugunu dogrulamamızı istiyor.
Router0(config-router)#network ?
	A.B.C.D Network number
Router0(config-router)#network 192.168.10.0 ?
	A.B.C.D OSPF wild card bits
// Burada Subnet Musk'in Tam tersi olmasına dikkat edilmelidir!
Router0(config-router)#network 192.168.10.0 0.0.0.255 ?
	area Set the OSPF area ID
Router0(config-router)#network 192.168.10.0 0.0.0.255 area 0
// Artık bu ortamda OSPF hello paketleri cıkmaya başladı.
Router0(config-router)#passive-interface gi0/0
// Gi0/0'in arkasından gelecek herhangi bir hello paketi olamaz. Router bulunmuyor dedik.
Router0(config-router)#network 10.1.0.0 0.0.255.255 area 0
// 10.1.0.0 ve 10.1.1.0'i tek bir subnet musk şeklinde gösterirsek iki networku de dahil etmiş oluruz.
Router0(config-router)#exit
Router0(config)#exit
Router0#show ip ospf neighbor
// hiçbir komşusu olmadığını görüyoruz.
Router0#show ip ospf interface
Router0#show ip ospf interface brief
// gi0/0 wait olarak bekliyor passive interface oldugu için ve gi0/1-2 DR olarak gözüküyor. 
Fakat bu 2 port Point-to-point bir interface oldugu için biz burda DR olmasını istemeyiz. Bu interfacelerin brodcast bir interface oldugunu düşünüyor.
Router0#conf t
Router0(config)#int ra gi0/1-2
Router0(config-if-range)#ip ospf network point-to-point
// Artık bu 2 interface'de DR veya BDR seçimi olmayacaktır.
Router0#show ip ospf interface brief
// Artık baktıgımızda State durumları Point olarak yapılandırıldı. Ve bu Router'a ilk OSPF komşusu olarak R2'yi tanımlayalım.

Router2(config)#router ospf 1
// istedigimiz ospf numarasını verebiliriz aynı olmak zorunda değil.
Router2(config-router)#router-id 2.2.2.2
Router2(config-router)#network 10.1.0.0 0.0.255.255 area 0
Router2(config-router)#auto-cost reference-bandwidth 10000
// Router2'ya bağlı 3 interface'i birden yapılandırdık. G0/0-1-2 10.1.x.x networkunun altında oldukları için…
Router2(config)#int ra gi0/0-2
Router2(config-if-range)#ip ospf network point-to-point
	03:02:29: %OSPF-5-ADJCHG: Process 1, Nbr 100.100.100.100 on GigabitEthernet0/1 from FULL to DOWN, Neighbor Down: Interface down or detached
	03:02:29: %OSPF-5-ADJCHG: Process 1, Nbr 100.100.100.100 on GigabitEthernet0/1 from LOADING to FULL, Loading Done
// Bize OSPF'den Adjency changed mesajı geldi. Bu mesaj Proccess 1'de çalışan OSPF 100.100.100.100 komşusu buldu ve şimdi down olup ardından Loading olup full state'de çalışmaya başladı
Router2#sh ip ospf neigh
	Neighbor ID            Pri     State           Dead Time                         Address Interface
	100.100.100.100     0      FULL/ -          00:00:37 10.1.0.1         GigabitEthernet0/1
// priority'e gerek yok cünkü bu bir P2P interface

Router5(config)#router ospf 2
Router5(config-router)#router-id 5.5.5.5
Router5(config-router)#auto-cost reference 10000
Router5(config-router)#network 10.1.0.0 0.0.255.255 area 0
Router5(config-router)#int ra gi0/0-2
Router5(config-if-range)#ip ospf network point-to-point
Router5#sh ip ospf neigh
Router5#sh ip route
// baktıgımızda O ile gösterilenler OSPF ile bağlanmış ve Bağlandıgı interface olarak SPF algoritmasından en yakın olan interface ayarlanmış. Biz bunu daha sonra değiştireceğiz.

Router1(config)#router ospf 2
Router1(config-router)#router-id 1.1.1.1
Router1(config-router)#auto-cost reference 10000
Router1(config-router)#passive-interface gi0/0
Router1(config-router)#int range gi0/0-2
Router1(config-if-range)#ip ospf 2 area 0
Router1(config-if-range)#int range gi0/1-2
Router1(config-if-range)#ip ospf network point-to-point

FW(config-router)#int ra gi0/0-2
FW(config-if-range)#ip ospf network point-to-point
FW(config-if-range)#ip ospf 2 area 0

// Biz Router 6'da bir portun point-to-point oldugunu diğer portun ise multiaccess olacağını belirteceğiz. Ve biz multiaccess'e alır almaz bu cihazın DR olmasını istiyoruz priority ile
Router6(config)#router ospf 2
Router6(config-router)#router-id 6.6.6.6
Router6(config-router)#auto-cost reference 10000
Router6(config-router)#int gi0/0
Router6(config-if)#ip ospf network point-to-point
Router6(config-if)#int ra gi0/0-1
Router6(config-if-range)#ip ospf 2 area 0

// Biz Router 7'da 2  portun point-to-point oldugunu diğer portun ise multiaccess olacağını belirteceğiz. Ve biz multiaccess'e alır almaz bu cihazın BDR olmasını istiyoruz priority ile
Router7(config)#router ospf 2
Router7(config-router)#router-id 7.7.7.7
Router7(config-router)#auto-cost reference 10000
Router7(config-router)#int ra gi0/0-1
Router7(config-if-range)#ip ospf network point-to-point
Router7(config-if-range)#int ra gi0/0-2
Router7(config-if-range)#ip ospf 2 area 0

// Biz bu 2 ortamda Priority'i belirlemedik dolayısıyla otomatik olarak belirlenmiş prority'si en büyük olanın DR cıkmasını bekleriz. Dolasıyıla R7'in DR, Router 6'in BDR olmasını bekleriz şuanki Router ID'lerine göre.

Router7#sh ip ospf neigh
// baktıgımızda istedigimiz gibi olmuş Router7'yi yapmadan önce router6 ortamda Hello paketleri göndererek DR paketi almıyorsam ben DR'im diye kendini belirledi.

Router6(config)#int gi0/1
Router6(config-if)#ip ospf priority ?
	<0-255> Priority
Router6(config-if)#ip ospf priority 255

Router7(config)#int gi0/2
Router7(config-if)#ip ospf priority 254
// Bu sayede DR düşerse BDR devreye girecektir.

Router9(config)#router ospf 2
Router9(config-router)#router-id 9.9.9.9
Router9(config-router)#auto-cost reference 10000
Router9(config-router)#int gi0/0
Router9(config-if)#ip ospf 2 area 0

Router8(config)#router ospf 2
Router8(config-router)#router-id 8.8.8.8
Router8(config-router)#auto-cost reference 10000
% OSPF: Reference bandwidth is changed.
Please ensure reference bandwidth is consistent across all routers.
Router8(config-router)#default-information originate 
// Default router'i OSPF'in içerisine dahil ettik
Router8(config-router)#int gi0/0
Router8(config-if)#ip ospf 2 area 0
// ve butun bu yapının içerisinde default information'u dahil ettik.

Google Sunucusu > 8.8.8.8 - 255.255.255.0 - 8.8.8.1

PC0> ping 8.8.8.8
// Unreachable hatası aldık ve bir yapılandırma eksigimiz olabilir. Router'lardan kontrolleri sağlayalım show ip route ile Baktıgımızda default information DR'a düşmemiş. Normal zamanda Router8'deki ip route 0.0.0.0 0.0.0.0 200.200.200.2 packet tracerdan kaynaklı interface ismi istiyor olabilir ip adresi yerine.

Router8(config-if)#no ip route 0.0.0.0 0.0.0.0 200.200.200.2 
Router8(config)#ip route 0.0.0.0 0.0.0.0 gi0/1
//Ve PC0'a en yakın Router0'dan show ip route ile baktıgımızda O*E2 diye gördügümüz default information olarak sisteme düştü.
Ve tekrar ping attıgımızda paketimiz geç de olsa ARP paketlerini kaydetti büyük bir network oldugu için ve ping iletişimi çalışmaya başladı.

PC0> tracert 8.8.8.8
Tracing route to 8.8.8.8 over a maximum of 30 hops: 
1 0 ms 0 ms 0 ms 192.168.10.254
2 0 ms 0 ms 0 ms 10.1.1.2
3 0 ms 0 ms 0 ms 10.1.4.2
4 0 ms 0 ms 0 ms 10.1.6.2
5 0 ms 0 ms 0 ms 10.100.100.4
6 0 ms 0 ms 0 ms 200.200.200.2
7 0 ms 0 ms 0 ms 8.8.8.8

// Paketimiz Load balancing yaptıgı için 10.1.3.0 networku yerine 10.1.4.0 üzerinden gitmiş oldu. Normalde bu durum CCNP eğitimlerine anlatır Load balancing'i engellemek için R2'den FW'a olan bağlantıyı koparalım ve R5'den FW'a yeni bir router ile bağlantı sağlayalım.

Router11(config)#int gi0/0
Router11(config-if)#ip add 10.1.4.2 255.255.255.0
Router11(config-if)#no sh
Router11(config-if)#ip ospf network point-to-point
Router11(config-if)#ip ospf 2 area 0
Router11(config-if)#router ospf 2
Router11(config-router)#router-id 11.11.11.11
Router11(config-router)#auto-cost reference 10000
Router11(config-router)#int gi0/1
Router11(config-if)#ip add 10.1.8.1 255.255.255.0
Router11(config-if)#no sh
Router11(config-if)#ip ospf network point-to-point
Router11(config-if)#ip ospf 2 area 0

FW(config)#int gi0/1
FW(config-if)#ip add 10.1.8.2 255.255.255.0
FW(config-if)#no sh
FW(config-if)#do sh ip ospf neigh
// Artık load-balancing yapan network de devre dışı kalacaktır.

PC0> tracert 8.8.8.8
Tracing route to 8.8.8.8 over a maximum of 30 hops: 
1 0 ms 0 ms 0 ms 192.168.10.254
2 0 ms 0 ms 0 ms 10.1.1.2
3 0 ms 0 ms 0 ms 10.1.3.2
4 0 ms 0 ms 0 ms 10.1.7.2
5 0 ms 0 ms 0 ms 10.100.100.4
6 11 ms 0 ms 0 ms 200.200.200.2
7 0 ms 0 ms 10 ms 8.8.8.8

// Fakat hala istedgimiz gibi bir tracert yapısından geçmiyor. Bir networke gidecekken o başka Branch networkun routerindan geçiyor. Bizim istedigimiz güzergah yukarıdan geçmesini istiyoruz. Bunu yapmamız için Router5'in gi0/0 ayağına cok yüksek bir cost değeri vermemiz gerekiyor. Bakalım cost değeri ne kadarmış. İstedigimiz yapı Network hızını düşürerek olur;

	- Router 5 <> Router 1 <> Router7 arasındaki networkler 1Gb/s olacak
	- Multiaccess Networkun tamamı 100 Mb/s olacak.
	- Bu durumda 1G olanlara 10 cost diyeceğiz, 100 mb olanlara 100 cost diyeceğiz. Toplamda 130 cost ile ulaşmayı bekliyoruz.

Router0#sh ip route
	O 10.100.100.0/24 [110/130] via 10.1.1.2, 00:20:31, GigabitEthernet0/1
// baktıgımızda 110-130 metric/cost arası ihtiyac oldugunu gösteriyor. Peki biz bunu 130'dan yukarıya cıkarabilirsek;
	- R0< 10 >R2< 10 >R11< 10 >FW< 10 >R6/R7< 100 >R8 toplamda = 140'a cikarabilirsek ve R5 < 20 > R1 yaparsak yukarıdaki hattı kullanabiliriz.

Router5(config)#int gi0/0
Router5(config-if)#ip ospf cost 100
//10'luk bir yeri 100'e çevirdik

Router0#sh ip route
	O 10.100.100.0/24 [110/140] via 10.1.0.2, 00:03:04, GigabitEthernet0/2

PC0 >tracert 8.8.8.8
Tracing route to 8.8.8.8 over a maximum of 30 hops: 

1 0 ms 0 ms 0 ms 192.168.10.254
2 0 ms 0 ms 0 ms 10.1.0.2
3 0 ms 0 ms 0 ms 10.1.4.2
4 * 0 ms 0 ms 10.1.8.2
5 0 ms 0 ms 0 ms 10.1.5.2
6 0 ms 1 ms 0 ms 10.100.100.4
7 0 ms 0 ms 0 ms 200.200.200.2
8 1 ms 1 ms 0 ms 8.8.8.8
// ve artık 8 adımda ilerledigimizi görüyoruz yani geçtigimiz yollara bakarsak üst yoldan istedigimiz yoldan geçtik

Router#clear ip ospf process
// Bu komut ile ospf işlemini yeniden başlatabiliriz dilersek.
//Şuanda bütün trafikler firewall üzerinden geçiyor R2-R1 arasındaki cost değerini cok yukseğe cıkardıgımız için giden paketler asla R2-R1 arasında olmayacaktır.
